fs2024_telefonia/app/Controllers/Clientes.php

    public function index(): string
    {
        //Creando un objeto de tipo RegionesModel
        $clientes = new ClientesModel();
        $datos['datos'] = $clientes->findAll(); //select * from clientes
---
SELECT *
FROM `clientes`