fs2024_telefonia/app/Controllers/ClientesController.php

    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos['datos'] = $clientes->findAll();
---
SELECT *
FROM `clientes`

    public function eliminarClientes($id = null)
    {
        $clientes = new ClientesModel(); //Models
        $clientes->delete($id); //Nombre de la llave primaria = la que se coloca en el controlador
---
DELETE FROM `clientes`
WHERE `cliente_id` IN ('3')

    public function actualizarClientes($id=null)
    {
        $clientes = new ClientesModel();
        $datos['datos'] = $clientes->where('cliente_id',$id)->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '3'
 LIMIT 1