fs2024_telefonia/app/Controllers/LineasTelefonicas.php

    public function index(): string
    {
        //Creando un objeto de tipo RegionesModel
        $lineastelefonicas = new LineasTelefonicasModel();
        $datos['datos'] = $lineastelefonicas->findAll(); //select * from clientes
---
SELECT *
FROM `lineas_telefonicas`