fs2024_telefonia/app/Controllers/LineasTelefonicasController.php

    public function index(): string
    {
        $lineastelefonicas = new LineasTelefonicasModel();
        $datos['datos'] = $lineastelefonicas->findAll();
---
SELECT *
FROM `lineas_telefonicas`

    public function eliminarLineasTelefonicas($no_telefono = null)
    {
        $lineastelefonicas = new LineasTelefonicasModel();
        $lineastelefonicas->delete( $no_telefono);
---
DELETE FROM `lineas_telefonicas`
WHERE `no_telefono` IN ('41406713')

    public function actualizarLineasTelefonicas($id = null)
    {
        $lineastelefonicas = new LineasTelefonicasModel();
        $datos['datos'] = $lineastelefonicas->where('no_telefono', $id)->first(); //Seleccionar en planes el planid y su valor
---
SELECT *
FROM `lineas_telefonicas`
WHERE `no_telefono` = '41406713'
 LIMIT 1