fs2024_telefonia/app/Controllers/Planes.php

SELECT *
FROM `planes`
---
    public function index(): string
    {
        //Creando un objeto de tipo RegionesModel
        $planes = new PlanesModel();
        $datos['datos'] = $planes->findAll(); //select * from clientes