fs2024_telefonia/app/Controllers/PlanesController.php

SELECT *
FROM `planes`
WHERE `plan_id` = '3'
 LIMIT 1
---
    public function actualizarPlanes($id = null)
    {
        $planes = new PlanesModel();
        $datos['datos'] = $planes->where('plan_id', $id)->first(); //Seleccionar en planes el planid y su valor